/*
 операторы сравнения - сравнивают значения и возвращают true или false
 операторы логические - соединяют несклько условий
 операторы присваивания - изменяют значение переменной
 Операторы сравнения:
 == - равно
 != - не равно
 > - больше
 < - меньше
 >= - больше или равно
 <= - меньше или равно
 Операторы логические:
 && - логическое И(AND), если оба true -> true, если хотя бы одно false -> false
 || - логическое ИЛИ(OR), если оба false -> false, если хотя бы одно true -> true
 ! - логическое не(NOT), меняет значение на противоположное
 Операторы присваивания:
 x += 10; x = x + 10
 x -= 10; x = x - 10
 x *= 10; x = x * 10
 x \= 10; x = x \ 10
 x %= 10; x = x % 10
*/

#include <iostream>
using namespace std;

int main()
{
    std::cout << "Hello World!\n";
    int a = 4;
    int c = 5;
    int b = 6;
    //cout << (a == b) << endl;
    //cout << (a != b) << endl;
    //cout << (a < b) << endl;
    //cout << (a > b) << endl;
    //cout << (a >= b) << endl;
    //cout << (a <= b) << endl;
    //cout << (a < c && a > b) << endl;
    //cout << (a < c || a > b) << endl;
    //cout << !(a < c) << endl;
    //cin >> a >> b >> c;
    //cout << (a != b && b != c && a != c) << endl;

    //cin >> a >> b >> c; 
    //cout << ((a % 2 == 0 && b % 2 != 0 && c % 2 != 0) || (b % 2 == 0 && a % 2 != 0 && c % 2 != 0) || (c % 2 == 0 && b % 2 != 0 && a % 2 != 0)) << endl;

    //cin >> a;
    //cout << (a % 2 == 0 && a > 0) << endl;

    //cin >> a >> b;
    //cout << ((a % 2 == 0 && b % 2 == 0) || (a % 2 != 0 && b % 2 != 0)) << endl;

    //cin >> a >> b >> c;
    //cout << ((a + b + c > 0) && (a < 0 || b < 0 || c < 0)) << endl;
}